In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
data['b']

2

In [17]:
population_dict = {
    'korea': 5180,
    'japan': 12718,
    'china': 141500,
    'usa': 32676
}
population = pd.Series(population_dict)
population.values

array([  5180,  12718, 141500,  32676], dtype=int64)

In [41]:
gdp_dict = {
    'korea': 169320000,
    'japan': 516700000,
    'china': 1409250000,
    'usa': 2041280000}

gdp = pd.Series(gdp_dict)
country = pd.DataFrame({
    'population': population,
    'gdp': gdp
})

gdp

korea     169320000
japan     516700000
china    1409250000
usa      2041280000
dtype: int64

In [52]:
gdp_per_capita = country['gdp'] / country['population']
gdp_per_capita
country['gdp per capita'] = round(gdp_per_capita, 2)

In [33]:
country.to_csv("./country.csv")
country2 = pd.read_csv("./country.csv")
country2

  Unnamed: 0  population         gdp  gdp per capita
0      korea        5180   169320000        32687.26
1      japan       12718   516700000        40627.46
2      china      141500  1409250000         9959.36
3        usa       32676  2041280000        62470.31

In [48]:
print("hieght")
height_dic = {
    'kyd': 123,
    'kky': 150,
    'pkk': 166,
    'iis': 157
}
height = pd.Series(height_dic)
height_df = pd.DataFrame(height, columns = ['height'])

weight_dic = {
    'kyd': 11,
    'kky': 15,
    'pkk': 17,
    'iis': 20
}
weight = pd.Series(weight_dic)
weight_df = pd.DataFrame(weight, columns = ['weight'])

total = pd.DataFrame({
    'height': height,
    'weight': weight
})
total

hieght

     height  weight
kyd     123      11
kky     150      15
pkk     166      17
iis     157      20

In [57]:
country

       population         gdp  gdp per capita
korea        5180   169320000        32687.26
japan       12718   516700000        40627.46
china      141500  1409250000         9959.36
usa         32676  2041280000        62470.31

In [66]:
country.iloc[1]

population        1.271800e+04
gdp               5.167000e+08
gdp per capita    4.062746e+04
Name: japan, dtype: float64

In [80]:
dataframe = pd.DataFrame(columns = ['이름', '나이', '주소'])
dataframe.loc[0] = ['임원균', '26', '서울']
dataframe.loc[1] = {'이름':'철수', '나이':'25', '주소':'인천'}
dataframe.loc[1, '이름'] = '영희'
dataframe['전화번호'] = np.nan
dataframe.loc[0, '전화번호'] = '01012341234'
dataframe

    이름  나이  주소         전화번호
0  임원균  26  서울  01012341234
1   영희  25  인천          NaN

In [85]:
dataframe['전화번호'] = dataframe['전화번호'].fillna('전화번호 없음')
dataframe

    이름  나이  주소         전화번호
0  임원균  26  서울  01012341234
1   영희  25  인천      전화번호 없음